burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_tzpcu.h
/*!
    \file    gd32w51x_f5hc_tzpcu.h
    \brief   definitions for the TZPCU

    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef gd32w51x_f5hc_TZPCU_H
#define gd32w51x_f5hc_TZPCU_H

#include "gd32w51x_f5hc.h"

/* TZPCU definitions */
#define TZSPC                                 TZSPC_BASE                        /*!< TZSPC base address */
#define TZBMPC0                               TZBMPC0_BASE                      /*!< TZBMPC0 base address */
#define TZBMPC1                               TZBMPC1_BASE                      /*!< TZBMPC1 base address */
#define TZBMPC2                               TZBMPC2_BASE                      /*!< TZBMPC2 base address */
#define TZBMPC3                               TZBMPC3_BASE                      /*!< TZBMPC3 base address */
#define TZIAC                                 TZIAC_BASE                        /*!< TZIAC base address */

/* registers definitions */
/* TZSPC registers */
#define TZPCU_TZSPC_CTL                       REG32((TZSPC) + 0x00000000U)      /*!< TZSPC control register */
#define TZPCU_TZSPC_SAM_CFG0                  REG32((TZSPC) + 0x00000010U)      /*!< TZSPC secure access mode configuration register 0 */
#define TZPCU_TZSPC_SAM_CFG1                  REG32((TZSPC) + 0x00000014U)      /*!< TZSPC secure access mode configuration register 1 */
#define TZPCU_TZSPC_SAM_CFG2                  REG32((TZSPC) + 0x00000018U)      /*!< TZSPC secure access mode configuration register 2 */
#define TZPCU_TZSPC_PAM_CFG0                  REG32((TZSPC) + 0x00000020U)      /*!< TZSPC privilege access mode configuration register 0 */
#define TZPCU_TZSPC_PAM_CFG1                  REG32((TZSPC) + 0x00000024U)      /*!< TZSPC privilege access mode configuration register 1 */
#define TZPCU_TZSPC_PAM_CFG2                  REG32((TZSPC) + 0x00000028U)      /*!< TZSPC privilege access mode configuration register 2 */
#define TZPCU_TZSPC_TZMMPC0_NSM0              REG32((TZSPC) + 0x00000030U)      /*!< TZSPC external memory 0 non-secure mark register 0 */
#define TZPCU_TZSPC_TZMMPC0_NSM1              REG32((TZSPC) + 0x00000034U)      /*!< TZSPC external memory 0 non-secure mark register 1 */
#define TZPCU_TZSPC_TZMMPC0_NSM2              REG32((TZSPC) + 0x00000038U)      /*!< TZSPC external memory 0 non-secure mark register 2 */
#define TZPCU_TZSPC_TZMMPC0_NSM3              REG32((TZSPC) + 0x0000003CU)      /*!< TZSPC external memory 0 non-secure mark register 3 */
#define TZPCU_TZSPC_TZMMPC1_NSM0              REG32((TZSPC) + 0x00000040U)      /*!< TZSPC external memory 1 non-secure mark register 0 */
#define TZPCU_TZSPC_TZMMPC1_NSM1              REG32((TZSPC) + 0x00000044U)      /*!< TZSPC external memory 1 non-secure mark register 1 */
#define TZPCU_TZSPC_DBG_CFG                   REG32((TZSPC) + 0x00000200U)      /*!< TZSPC debug configuration register */

/* TZBMPC registers */
#define TZPCU_TZBMPC_CTL(tzbmpx)              REG32((tzbmpx) + 0x00000000U)     /*!< TZBMPC control register */
#define TZPCU_TZBMPC_VEC(tzbmpx, y)           REG32((tzbmpx) + 0x00000100U\
                                                  + (0x00000004U * (y)))        /*!< TZBMPC vector register */
#define TZPCU_TZBMPC_LOCK0(tzbmpx)            REG32((tzbmpx) + 0x00000010U)     /*!< TZBMPC lock register 0 */

/* TZIAC registers */
#define TZPCU_TZIAC_INTEN0                    REG32((TZIAC) + 0x00000000U)      /*!< TZIAC enable register 0 */
#define TZPCU_TZIAC_INTEN1                    REG32((TZIAC) + 0x00000004U)      /*!< TZIAC enable register 1 */
#define TZPCU_TZIAC_INTEN2                    REG32((TZIAC) + 0x00000008U)      /*!< TZIAC enable register 2 */
#define TZPCU_TZIAC_STAT0                     REG32((TZIAC) + 0x00000010U)      /*!< TZIAC status register 0 */
#define TZPCU_TZIAC_STAT1                     REG32((TZIAC) + 0x00000014U)      /*!< TZIAC status register 1 */
#define TZPCU_TZIAC_STAT2                     REG32((TZIAC) + 0x00000018U)      /*!< TZIAC status register 2 */
#define TZPCU_TZIAC_STATC0                    REG32((TZIAC) + 0x00000020U)      /*!< TZIAC flag clear register 0 */
#define TZPCU_TZIAC_STATC1                    REG32((TZIAC) + 0x00000024U)      /*!< TZIAC flag clear register 1 */
#define TZPCU_TZIAC_STATC2                    REG32((TZIAC) + 0x00000028U)      /*!< TZIAC flag clear register 2 */

/* bits definitions */
/* TZPCU_TZSPC_CTL */
#define TZPCU_TZSPC_CTL_LK                    BIT(0)                            /*!< TZSPC items lock configuration bit */

