burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_tzpcu.h
/* TZPCU_TZSPC_SAM_CFG0 */
#define TZPCU_TZSPC_SAM_CFG0_TIMER1SAM        BIT(0)                            /*!< TIMER1 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_TIMER2SAM        BIT(1)                            /*!< TIMER2 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_TIMER3SAM        BIT(2)                            /*!< TIMER3 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_TIMER4SAM        BIT(3)                            /*!< TIMER4 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_TIMER5SAM        BIT(4)                            /*!< TIMER5 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_WWDGTSAM         BIT(6)                            /*!< WWDGT secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_FWDGTSAM         BIT(7)                            /*!< FWDGT secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_SPI1SAM          BIT(8)                            /*!< SPI1 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_USART1SAM        BIT(10)                           /*!< USART1 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_USART2SAM        BIT(11)                           /*!< USART2 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_I2C0SAM          BIT(14)                           /*!< I2C0 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_I2C1SAM          BIT(15)                           /*!< I2C1 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_USBFSSAM         BIT(26)                           /*!< USBFS secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_TIMER0SAM        BIT(30)                           /*!< TIMER0 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG0_SPI0SAM          BIT(31)                           /*!< SPI0 secure access mode configuration bit */

/* TZPCU_TZSPC_SAM_CFG1 */
#ifdef GD32F5HC
#define TZPCU_TZSPC_SAM_CFG1_CTCSEC           BIT(0)                            /*!< CTC secure access mode configuration bit */
#endif
#define TZPCU_TZSPC_SAM_CFG1_USART0SAM        BIT(1)                            /*!< USART0 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG1_TIMER15SAM       BIT(3)                            /*!< TIMER15 secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG1_TIMER16SAM       BIT(4)                            /*!< TIMER16 secure access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_SAM_CFG1_HPDFSAM          BIT(7)                            /*!< HPDF secure access mode configuration bit(not support on GD32W515TX series devices) */
#endif
#define TZPCU_TZSPC_SAM_CFG1_CRCSAM           BIT(8)                            /*!< CRC secure access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_SAM_CFG1_TSISAM           BIT(9)                            /*!< TSI secure access mode configuration bit */
#endif
#define TZPCU_TZSPC_SAM_CFG1_ICACHESAM        BIT(10)                           /*!< ICACHE secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG1_ADCSAM           BIT(11)                           /*!< ADC secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG1_CAUSAM           BIT(12)                           /*!< CAU secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG1_HAUSAM           BIT(13)                           /*!< HAU secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG1_TRNGSAM          BIT(14)                           /*!< TRNG secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG1_PKCAUSAM         BIT(15)                           /*!< PKCAU secure access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_SAM_CFG1_SDIOSAM          BIT(16)                           /*!< SDIO secure access mode configuration bit */
#endif

/* TZPCU_TZSPC_SAM_CFG2 */
#define TZPCU_TZSPC_SAM_CFG2_EFUSESAM         BIT(23)                           /*!< EFUSE secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG2_SQPI_PSRAMREGSAM BIT(26)                           /*!< SQPI PSRAMREG secure access mode configuration bit */
#define TZPCU_TZSPC_SAM_CFG2_QSPI_FLASHREGSAM BIT(27)                           /*!< QSPI FLASHREG secure access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_SAM_CFG2_WIFI_RFSAM       BIT(28)                           /*!< WIFI RF secure access mode configuration bit */
#endif
#define TZPCU_TZSPC_SAM_CFG2_I2S1_ADDSAM      BIT(29)                           /*!< I2S1_ADD secure access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_SAM_CFG2_DCISAM           BIT(30)                           /*!< DCI secure access mode configuration bit(not support on GD32W515TX series devices) */
#define TZPCU_TZSPC_SAM_CFG2_WIFISAM          BIT(31)                           /*!< WIFI secure access mode configuration bit */
#endif

/* TZPCU_TZSPC_PAM_CFG0 */
#define TZPCU_TZSPC_PAM_CFG0_TIMER1PAM        BIT(0)                            /*!< TIMER1 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_TIMER2PAM        BIT(1)                            /*!< TIMER2 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_TIMER3PAM        BIT(2)                            /*!< TIMER3 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_TIMER4PAM        BIT(3)                            /*!< TIMER4 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_TIMER5PAM        BIT(4)                            /*!< TIMER5 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_WWDGTPAM         BIT(6)                            /*!< WWDGT privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_FWDGTPAM         BIT(7)                            /*!< FWDGT privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_SPI1PAM          BIT(8)                            /*!< SPI1 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_USART1PAM        BIT(10)                           /*!< USART1 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_USART2PAM        BIT(11)                           /*!< USART2 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_I2C0PAM          BIT(14)                           /*!< I2C0 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_I2C1PAM          BIT(15)                           /*!< I2C1 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_USBFSPAM         BIT(26)                           /*!< USBFS privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_TIMER0PAM        BIT(30)                           /*!< TIMER0 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG0_SPI0PAM          BIT(31)                           /*!< SPI0 privilege access mode configuration bit */

