burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_tzpcu.h
/* TZPCU_TZSPC_PAM_CFG1 */
#ifndef GD32F5HC
#define TZPCU_TZSPC_PAM_CFG1_CTCPRIV          BIT(0)                            /*!< CTC privilege access mode configuration bit */
#endif
#define TZPCU_TZSPC_PAM_CFG1_USART0PAM        BIT(1)                            /*!< USART0 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_TIMER15PAM       BIT(3)                            /*!< TIMER15 privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_TIMER16PAM       BIT(4)                            /*!< TIMER16 privilege access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_PAM_CFG1_HPDFPAM          BIT(7)                            /*!< HPDF privilege access mode configuration bit(not support on GD32W515TX series devices) */
#endif
#define TZPCU_TZSPC_PAM_CFG1_CRCPAM           BIT(8)                            /*!< CRC privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_TSIPAM           BIT(9)                            /*!< TSI privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_ICACHEPAM        BIT(10)                           /*!< ICACHE privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_ADCPAM           BIT(11)                           /*!< ADC privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_CAUPAM           BIT(12)                           /*!< CAU privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_HAUPAM           BIT(13)                           /*!< HAU privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_TRNGPAM          BIT(14)                           /*!< TRNG privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG1_PKCAUPAM         BIT(15)                           /*!< PKCAU privilege access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_PAM_CFG1_SDIOPAM          BIT(16)                           /*!< SDIO privilege access mode configuration bit */
#endif

/* TZPCU_TZSPC_PAM_CFG2 */
#define TZPCU_TZSPC_PAM_CFG2_EFUSEPAM         BIT(23)                           /*!< EFUSE privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG2_DBGPAM           BIT(25)                           /*!< DBG privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG2_SQPI_PSRAMREGPAM BIT(26)                           /*!< SQPI PSRAMREG privilege access mode configuration bit */
#define TZPCU_TZSPC_PAM_CFG2_QSPI_FLASHREGPAM BIT(27)                           /*!< QSPI FLASHREG privilege access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_PAM_CFG2_WIFI_RFPAM       BIT(28)                           /*!< WIFI RF privilege access mode configuration bit */
#endif
#define TZPCU_TZSPC_PAM_CFG2_I2S1_ADDPAM      BIT(29)                           /*!< I2S1_ADD privilege access mode configuration bit */
#ifndef GD32F5HC
#define TZPCU_TZSPC_PAM_CFG2_DCIPAM           BIT(30)                           /*!< DCI privilege access mode configuration bit(not support on GD32W515TX series devices) */
#define TZPCU_TZSPC_PAM_CFG2_WIFIPAM          BIT(31)                           /*!< WIFI privilege access mode configuration bit */
#endif

/* TZPCU_TZSPC_TZMMPCx_NSM0, TZPCU_TZSPC_TZMMPCx_NSM1, TZPCU_TZSPC_TZMMPCx_NSM2 and TZPCU_TZSPC_TZMMPCx_NSM3 */
#define TZPCU_TZSPC_TZMMPC_NSM_SADD           BITS(0,13)                        /*!< the first non-secure area (multiple of 8 Kbytes) start address */
#define TZPCU_TZSPC_TZMMPC_NSM_LEN            BITS(16,30)                       /*!< length of the first non-secure area (multiple of 8 Kbytes) */

/* TZPCU_TZSPC_DBG_CFG */
#define TZPCU_TZSPC_DBG_CFG_IDEN              BIT(0)                            /*!< invasive debug enable bit */
#define TZPCU_TZSPC_DBG_CFG_NIDEN             BIT(1)                            /*!< non-invasive debug enable bit */
#define TZPCU_TZSPC_DBG_CFG_SPIDEN            BIT(2)                            /*!< secure invasive debug enable bit */
#define TZPCU_TZSPC_DBG_CFG_SPNIDEN           BIT(3)                            /*!< secure non-invasive debug enable bit */

/* TZPCU_TZBMPC_CTL */
#define TZPCU_TZBMPC_CTL_LK                   BIT(0)                            /*!< the control register of the TZBMPC sub-block lock configuration bit */
#define TZPCU_TZBMPC_CTL_SECSTATCFG           BIT(30)                           /*!< security state configuration bit. */
#define TZPCU_TZBMPC_CTL_SRWACFG              BIT(31)                           /*!< secure read/write access non-secure SRAM configuration bit. */

/* TZPCU_TZBMPC_VEC */
#define TZPCU_TZBMPC_VEC_B0                   BIT(0)                            /*!< block 0 state */
#define TZPCU_TZBMPC_VEC_B1                   BIT(1)                            /*!< block 1 state */
#define TZPCU_TZBMPC_VEC_B2                   BIT(2)                            /*!< block 2 state */
#define TZPCU_TZBMPC_VEC_B3                   BIT(3)                            /*!< block 3 state */
#define TZPCU_TZBMPC_VEC_B4                   BIT(4)                            /*!< block 4 state */
#define TZPCU_TZBMPC_VEC_B5                   BIT(5)                            /*!< block 5 state */
#define TZPCU_TZBMPC_VEC_B6                   BIT(6)                            /*!< block 6 state */
#define TZPCU_TZBMPC_VEC_B7                   BIT(7)                            /*!< block 7 state */
#define TZPCU_TZBMPC_VEC_B8                   BIT(8)                            /*!< block 8 state */
#define TZPCU_TZBMPC_VEC_B9                   BIT(9)                            /*!< block 9 state */
#define TZPCU_TZBMPC_VEC_B10                  BIT(10)                           /*!< block 10 state */
#define TZPCU_TZBMPC_VEC_B11                  BIT(11)                           /*!< block 11 state */
#define TZPCU_TZBMPC_VEC_B12                  BIT(12)                           /*!< block 12 state */
#define TZPCU_TZBMPC_VEC_B13                  BIT(13)                           /*!< block 13 state */
#define TZPCU_TZBMPC_VEC_B14                  BIT(14)                           /*!< block 14 state */
#define TZPCU_TZBMPC_VEC_B15                  BIT(15)                           /*!< block 15 state */
#define TZPCU_TZBMPC_VEC_B16                  BIT(16)                           /*!< block 16 state */
#define TZPCU_TZBMPC_VEC_B17                  BIT(17)                           /*!< block 17 state */
#define TZPCU_TZBMPC_VEC_B18                  BIT(18)                           /*!< block 18 state */
#define TZPCU_TZBMPC_VEC_B19                  BIT(19)                           /*!< block 19 state */
#define TZPCU_TZBMPC_VEC_B20                  BIT(20)                           /*!< block 20 state */
#define TZPCU_TZBMPC_VEC_B21                  BIT(21)                           /*!< block 21 state */
#define TZPCU_TZBMPC_VEC_B22                  BIT(22)                           /*!< block 22 state */
#define TZPCU_TZBMPC_VEC_B23                  BIT(23)                           /*!< block 23 state */
#define TZPCU_TZBMPC_VEC_B24                  BIT(24)                           /*!< block 24 state */
#define TZPCU_TZBMPC_VEC_B25                  BIT(25)                           /*!< block 25 state */
#define TZPCU_TZBMPC_VEC_B26                  BIT(26)                           /*!< block 26 state */
#define TZPCU_TZBMPC_VEC_B27                  BIT(27)                           /*!< block 27 state */
#define TZPCU_TZBMPC_VEC_B28                  BIT(28)                           /*!< block 28 state */
#define TZPCU_TZBMPC_VEC_B29                  BIT(29)                           /*!< block 29 state */
#define TZPCU_TZBMPC_VEC_B30                  BIT(30)                           /*!< block 30 state */
#define TZPCU_TZBMPC_VEC_B31                  BIT(31)                           /*!< block 31 state */

/* TZPCU_TZBMPC_LOCK0 */
#define TZPCU_TZBMPC_LOCK0_LKUB0              BIT(0)                            /*!< the secure access mode lock configuration bit of union-blocks 0 */
#define TZPCU_TZBMPC_LOCK0_LKUB1              BIT(1)                            /*!< the secure access mode lock configuration bit of union-blocks 1 */
#define TZPCU_TZBMPC_LOCK0_LKUB2              BIT(2)                            /*!< the secure access mode lock configuration bit of union-blocks 2 */
#define TZPCU_TZBMPC_LOCK0_LKUB3              BIT(3)                            /*!< the secure access mode lock configuration bit of union-blocks 3 */
#define TZPCU_TZBMPC_LOCK0_LKUB4              BIT(4)                            /*!< the secure access mode lock configuration bit of union-blocks 4 */
#define TZPCU_TZBMPC_LOCK0_LKUB5              BIT(5)                            /*!< the secure access mode lock configuration bit of union-blocks 5 */
#define TZPCU_TZBMPC_LOCK0_LKUB6              BIT(6)                            /*!< the secure access mode lock configuration bit of union-blocks 6 */
#define TZPCU_TZBMPC_LOCK0_LKUB7              BIT(7)                            /*!< the secure access mode lock configuration bit of union-blocks 7 */
#define TZPCU_TZBMPC_LOCK0_LKUB8              BIT(8)                            /*!< the secure access mode lock configuration bit of union-blocks 8 */
#define TZPCU_TZBMPC_LOCK0_LKUB9              BIT(9)                            /*!< the secure access mode lock configuration bit of union-blocks 9 */
#define TZPCU_TZBMPC_LOCK0_LKUB10             BIT(10)                           /*!< the secure access mode lock configuration bit of union-blocks 10 */
#define TZPCU_TZBMPC_LOCK0_LKUB11             BIT(11)                           /*!< the secure access mode lock configuration bit of union-blocks 11 */
#define TZPCU_TZBMPC_LOCK0_LKUB12             BIT(12)                           /*!< the secure access mode lock configuration bit of union-blocks 12 */
#define TZPCU_TZBMPC_LOCK0_LKUB13             BIT(13)                           /*!< the secure access mode lock configuration bit of union-blocks 13 */
#define TZPCU_TZBMPC_LOCK0_LKUB14             BIT(14)                           /*!< the secure access mode lock configuration bit of union-blocks 14 */
#define TZPCU_TZBMPC_LOCK0_LKUB15             BIT(15)                           /*!< the secure access mode lock configuration bit of union-blocks 15 */
#define TZPCU_TZBMPC_LOCK0_LKUB16             BIT(16)                           /*!< the secure access mode lock configuration bit of union-blocks 16 */
#define TZPCU_TZBMPC_LOCK0_LKUB17             BIT(17)                           /*!< the secure access mode lock configuration bit of union-blocks 17 */
#define TZPCU_TZBMPC_LOCK0_LKUB18             BIT(18)                           /*!< the secure access mode lock configuration bit of union-blocks 18 */
#define TZPCU_TZBMPC_LOCK0_LKUB19             BIT(19)                           /*!< the secure access mode lock configuration bit of union-blocks 19 */
#define TZPCU_TZBMPC_LOCK0_LKUB20             BIT(20)                           /*!< the secure access mode lock configuration bit of union-blocks 20 */
#define TZPCU_TZBMPC_LOCK0_LKUB21             BIT(21)                           /*!< the secure access mode lock configuration bit of union-blocks 21 */
#define TZPCU_TZBMPC_LOCK0_LKUB22             BIT(22)                           /*!< the secure access mode lock configuration bit of union-blocks 22 */
#define TZPCU_TZBMPC_LOCK0_LKUB23             BIT(23)                           /*!< the secure access mode lock configuration bit of union-blocks 23 */

/* TZPCU_TZIAC_INTEN0 */
#define TZPCU_TZIAC_INTEN0_TIMER1IE           BIT(0)                            /*!< TIMER1 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_TIMER2IE           BIT(1)                            /*!< TIMER2 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_TIMER3IE           BIT(2)                            /*!< TIMER3 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_TIMER4IE           BIT(3)                            /*!< TIMER4 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_TIMER5IE           BIT(4)                            /*!< TIMER5 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_WWDGTIE            BIT(6)                            /*!< WWDGT illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_FWDGTIE            BIT(7)                            /*!< FWDGT illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_SPI1IE             BIT(8)                            /*!< SPI1 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_USART1IE           BIT(10)                           /*!< USART1 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_USART2IE           BIT(11)                           /*!< USART2 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_I2C0IE             BIT(14)                           /*!< I2C0 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_I2C1IE             BIT(15)                           /*!< I2C1 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_USBFSIE            BIT(26)                           /*!< USBFS illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_TIMER0IE           BIT(30)                           /*!< TIMER0 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN0_SPI0IE             BIT(31)                           /*!< SPI0 illegal access interrupt enable bit */

/* TZPCU_TZIAC_INTEN1 */
#ifdef GD32F5HC
#define TZPCU_TZIAC_INTEN1_CTCIE              BIT(0)                            /*!< CTC illegal access interrupt enable bit */
#endif
#define TZPCU_TZIAC_INTEN1_USART0IE           BIT(1)                            /*!< USART0 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_TIMER15IE          BIT(3)                            /*!< TIMER15 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_TIMER16IE          BIT(4)                            /*!< TIMER16 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_HPDFIE             BIT(7)                            /*!< HPDF illegal access interrupt enable bit(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_INTEN1_CRCIE              BIT(8)                            /*!< CRC illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_TSIIE              BIT(9)                            /*!< TSI illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_ICACHEIE           BIT(10)                           /*!< ICACHE illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_ADCIE              BIT(11)                           /*!< ADC illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_CAUIE              BIT(12)                           /*!< CAU illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_HAUIE              BIT(13)                           /*!< HAU illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_TRNGIE             BIT(14)                           /*!< TRNG illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_PKCAUIE            BIT(15)                           /*!< PKCAU illegal access interrupt enable bit */
#ifndef GD32F5HC
#define TZPCU_TZIAC_INTEN1_SDIOIE             BIT(16)                           /*!< SDIO illegal access interrupt enable bit */
#endif
#define TZPCU_TZIAC_INTEN1_RTCIE              BIT(19)                           /*!< RTC illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_PMUIE              BIT(20)                           /*!< PMU illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_SYSCFGIE           BIT(21)                           /*!< SYSCFG illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_DMA0IE             BIT(22)                           /*!< DMA0 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_DMA1IE             BIT(23)                           /*!< DMA1 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_RCUIE              BIT(25)                           /*!< RCU illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_FLASHIE            BIT(26)                           /*!< FLASH illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_FMCIE              BIT(27)                           /*!< FMC illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN1_EXTIIE             BIT(28)                           /*!< EXTI illegal access interrupt enable bit */

