burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_tzpcu.h
#define TZPCU_TZIAC_FLAG_TZSPC               (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_TZSPCIAF)                        /*!< TZSPC peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZIAC               (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_TZIACIAF)                        /*!< TZIAC peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SRAM0               (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_SRAM0IAF)                        /*!< SRAM0 peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZBMPC0_REG         (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_TZBMPC0_REGIAF)                  /*!< TZBMPC0_REG peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SRAM1               (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_SRAM1IAF)                        /*!< SRAM1 peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZBMPC1_REG         (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_TZBMPC1_REGIAF)                  /*!< TZBMPC1_REG peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SRAM2               (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_TZBMPC2_REGIAF)                  /*!< SRAM2 peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZBMPC2_REG         (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_TZBMPC2_REGIAF)                  /*!< TZBMPC2_REG peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SRAM3               (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_TZBMPC3_REGIAF)                  /*!< SRAM3 peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZBMPC3_REG         (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_TZBMPC3_REGIAF)                  /*!< TZBMPC3_REG peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_EFUSE               (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_EFUSEIAF)                        /*!< EFUSE peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SQPI_PSRAM          (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_SQPI_PSRAMIAF)                   /*!< SQPI_PSRAM peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_QSPI_FLASH          (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_QSPI_FLASHIAF)                   /*!< QSPI_FLASH peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SQPI_PSRAMREG       (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_SQPI_PSRAMREGIAF)                /*!< SQPI PSRAMREG peripheral illegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_QSPI_FLASHREG       (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_QSPI_FLASHREGIAF)                /*!< QSPI FLASHREG peripheral illegal access interrupt flag definitions */
#if !defined (GD32F5HC)
#define TZPCU_TZIAC_FLAG_WIFI_RF             (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_WIFI_RFIAF)                      /*!< WIFI RF peripheral illegal access interrupt flag definitions */
#endif
#define TZPCU_TZIAC_FLAG_I2S1_ADD            (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_I2S1_ADDIAF)                     /*!< I2S1_ADD peripheral illegal access interrupt flag definitions */
#if !defined (GD32F5HC)
#define TZPCU_TZIAC_FLAG_DCI                 (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_DCIIAF)                          /*!< DCI peripheral illegal access interrupt flag definitions(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_FLAG_WIFI                (((uint32_t)0x20000000U) | TZPCU_TZIAC_STAT2_WIFIIAF)                         /*!< WIFI peripheral illegal access interrupt flag definitions */
#endif
#define TZPCU_TZIAC_FLAG_ALL                 BIT(22)                                       /*!< all peripheral illegal access interrupt flag definitions  */

/* peripheral attributes definitions */
#define TZPCU_SEC                            (BIT(28) | (uint32_t)0x00000001U)             /*!< peripheral secure attribute */
#define TZPCU_NSEC                           (BIT(28) | (uint32_t)0x00000000U)             /*!< peripheral non-secure attribute */
#define TZPCU_PRIV                           (BIT(29) | (uint32_t)0x00000002U)             /*!< peripheral privilege attribute */
#define TZPCU_NPRIV                          (BIT(29) | (uint32_t)0x00000000U)             /*!< peripheral non-privilege attribute */

/* QSPI flash and SQPI PSRAM configuration flag for non_secure_mark_struct member 'memory_type' */
typedef enum
{
    QSPI_FLASH_MEM = 0U,                                                /*!< QSPI flash memory */
    SQPI_PSRAM_MEM                                                      /*!< SQPI PSRAM memory */
}tzpcu_mem;

/* QSPI flash and SQPI PSRAM non secure mark region flag for non_secure_mark_struct member 'region_number' */
typedef enum
{
    NON_SECURE_MARK_REGION0            = 0U,                            /*!< non secure mark region 0 */
    NON_SECURE_MARK_REGION1,                                            /*!< non secure mark region 1 */
    NON_SECURE_MARK_REGION2,                                            /*!< non secure mark region 2(QSPI flash only) */
    NON_SECURE_MARK_REGION3                                             /*!< non secure mark region 3(QSPI flash only) */
}tzpcu_non_secure_mark_region;

/* structure of external memory non-secure mark */ 
typedef struct
{
    tzpcu_mem memory_type;                                             /*!< memory type, refer to tzpcu_mem */
    tzpcu_non_secure_mark_region region_number;                        /*!< non secure mark region number, refer to tzpcu_non_secure_mark_region */
    uint32_t start_address;                                            /*!< external memory non-secure area start address */
    uint32_t length;                                                   /*!< external memory non-secure area length */
}tzpcu_non_secure_mark_struct;

#define EXT_MEM_GRANULARITY               (0x2000U)                    /*!< granularity of QSPI flash and SQPI PSRAM is 8K */

/* debug type */
#define INVASIVE_DEBUG                    TZPCU_TZSPC_DBG_CFG_IDEN     /*!< invasive debug */
#define NON_INVASIVE_DEBUG                TZPCU_TZSPC_DBG_CFG_NIDEN    /*!< non-invasive debug */
#define SECURE_INVASIVE_DEBUG             TZPCU_TZSPC_DBG_CFG_SPIDEN   /*!< secure invasive debug */
#define SECURE_NON_INVASIVE_DEBUG         TZPCU_TZSPC_DBG_CFG_SPNIDEN  /*!< secure non-Invasive debug */

#define SECURE_ILLEGAL_ACCESS_ENABLE      ((uint32_t)0x00000001U)      /*!< secure read/write access non-secure SRAM is illegal */
#define SECURE_ILLEGAL_ACCESS_DISABLE     ((uint32_t)0x00000000U)      /*!< secure read/write access non-secure SRAM is legal */

/* default security state */
#define DEFAULT_STATE                     ((uint32_t)0x00000000U)      /*!< default state (source clock secured if a secure area exists in the TZBMPC and vice-versa) */
#define INVERT_STATE                      ((uint32_t)0x00000001U)      /*!< invert the state, source clock remains secure even if no secure block is set in the TZBMPC */

/* block secure access mode */
#define BLOCK_SECURE_ACCESS_MODE_SEC      ((uint32_t)0x00000000U)     /*!< block secure access mode is secure */
#define BLOCK_SECURE_ACCESS_MODE_NSEC     ((uint32_t)0x00000001U)     /*!< block secure access mode is non-secure */

