burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_tzpcu.h
/* union block lock configure */
#define UNION_BLOCK_LOCK                  ((uint32_t)0x00000001U)     /*!< lock union block */
#define UNION_BLOCK_UNLOCK                ((uint32_t)0x00000000U)     /*!< unlock union block */

/* illegal access event flag */
#define NO_ILLEGAL_ACCESS_PENDING         ((uint32_t)0x00000000U)     /*!< no illegal access event pending */
#define ILLEGAL_ACCESS_PENDING            ((uint32_t)0x00000001U)     /*!< illegal access event pending */

/* function declarations */
/* TZSPC function */
/* configure peripherals secure attributes */
void tzpcu_tzspc_attributes_config(uint32_t periph, uint32_t attributes);
/* get peripherals secure attributes */
uint32_t tzpcu_tzspc_attributes_get(uint32_t periph);

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
/* initialize the TZPCU non-secure mark struct with the default values */
void tzpcu_non_secure_mark_struct_para_init(tzpcu_non_secure_mark_struct* init_struct);
/* configure external memory non-secure mark */
ErrStatus tzpcu_tzspc_emnsm_config(tzpcu_non_secure_mark_struct *p_non_secure_mark);
/* lock TZSPC items */
void tzpcu_tzspc_items_lock(void);
/* configure debug type */
void tzpcu_tzspc_dbg_config(uint32_t dbg_type, ControlStatus config_value);
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/* TZBMPC function */
/* lock the control register of the TZBMPC sub-block */
void tzpcu_tzbmpc_lock(uint32_t tzbmpx);
/* configure default security state */
void tzpcu_tzbmpc_security_state_config(uint32_t tzbmpx, uint32_t sec_state);
/* configure secure access state */
void tzpcu_tzbmpc_secure_access_config(uint32_t tzbmpx, uint32_t sec_illaccess_state);
/* configure block secure access mode */
void tzpcu_tzbmpc_block_secure_access_mode_config(uint32_t tzbmpx, uint32_t block_pos_num, uint32_t access_mode);
/* lock configure union block secure access mode */
void tzpcu_tzbmpc_union_block_lock(uint32_t tzbmpx, uint32_t union_block_position_num);

/* TZIAC function */
/* enable illegal access interrupt */
void tzpcu_tziac_interrupt_enable(uint32_t periph);
/* disable illegal access interrupt */
void tzpcu_tziac_interrupt_disable(uint32_t periph);
/* get illegal access interrupt flag */
uint32_t tzpcu_tziac_flag_get(uint32_t periph_flag);
/* clear illegal access interrupt flag */
void tzpcu_tziac_flag_clear(uint32_t periph_flag);

#endif /* gd32w51x_f5hc_TZPCU_H */
